<a href="https://colab.research.google.com/github/wcrowley342/mode_tutorial/blob/main/Mode_Python_Tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://mode.com/python-tutorial/

# [Python Basics](https:////mode.com/python-tutorial/python-basics/)

In [ ]:
a = 6 
b = 2

print(a/b)

3.0

In [ ]:
first_string = "hello from mode"
print(first_string)

hello from mode

**Lists**

In [ ]:
cities_list = ['Tokyo','Los Angeles','New York','San Francisco']
cities_list[1]

'Los Angeles'

In [ ]:
cities_list[2:4]

['New York', 'San Francisco']

**Dictionaries**

In [ ]:
city_population = {
    'Tokyo': 13350000, # a key-value pair
    'Los Angeles': 18550000,
    'New York City': 8400000,
    'San Francisco': 1837442,
}

In [ ]:
city_population['New York City']

8400000

adding a key-value pair to the dictionary

“=” will assign a given value to a specific key, regardless of whether the key already exists in the dictionary. If it already exists, the new value will overwrite the previous one.

In [ ]:
city_population['Mumbai'] = 11980000

In [ ]:
city_population

{'Los Angeles': 18550000,
 'Mumbai': 11980000,
 'New York City': 8400000,
 'San Francisco': 1837442,
 'Tokyo': 13350000}

**Boolean Objects**

In [ ]:
type(True)

bool

In [ ]:
city_population['Tokyo'] == 13350000

#two equal signs will test for equality, but one equal sign will assign a variable. If you removed one of the equal signs, you would change the value of Tokyo's population in the dictionary

True

In [ ]:
city_population['Tokyo'] == 23350000

False

[# Python Methods, Functions, & Libraries](mode.com/python-tutorial/python-methods-functions-and-libraries/)

# [Python Methods, Functions, and Libraries](https://mode.com/python-tutorial/python-methods-functions-and-libraries/)

In [ ]:
#using a simple dictionary
city_population = {
  'Tokyo': 13350000, # a key-value pair
  'Los Angeles': 18550000,
  'New York City': 8400000,
  'San Francisco': 1837442,
}

**Methods**

A method is an action that you can take on an object. If a real-world window was an object, its methods might be .open() or .close().

In [ ]:
city_population.keys()

dict_keys(['Tokyo', 'Los Angeles', 'New York City', 'San Francisco'])

In [ ]:
type(city_population.keys())

dict_keys

In [ ]:
city_population.values()

dict_values([13350000, 18550000, 8400000, 1837442])

**Functions**

They're very similar to methods in that they perform an action, but unlike methods, functions are not tied to specific objects. To relate this concept to our earlier window example, the function throw_rock() could be used with a real-world object window, but also with vase or cow or a number of other objects.

Functions typically go in front of an object name (with the object wrapped in parentheses), whereas a method is appended to the end of an object name. For example, compare throw_rock(window) with window.open().

In [ ]:
#type is a common function

type(city_population['Tokyo'])

int

**Libraries**

A library is a bundle of code made to help you accomplish routine tasks more quickly. Seaborn, for example, allows you to create visualizations with as little as one line of code.

In [ ]:
import numpy as np # name of the library

In [ ]:
#converting a dictionary into a numpy array

data = list(city_population.items())
my_array = np.array(data)

In [ ]:
my_array

array([['Tokyo', '13350000'],
       ['Los Angeles', '18550000'],
       ['New York City', '8400000'],
       ['San Francisco', '1837442']], dtype='<U13')

# [Creating DataFrames & Selecting Data](https://mode.com/python-tutorial/pandas-dataframe/)

In python, table with multiple columns is a **DataFrame**; because DataFrames are built in Python, it's possible to use Python to program more advanced operations and manipulations than SQL and Excel can offer

you should get in the habit of giving librarias aliases so you can refer to them easily throughout your code. 

Pandas (which focus on tables/dataframes) is typically aliased as pd:

In [8]:
import pandas as pd

Numpy (which focus on lists or arrays as they are called in python) is typically aliased as np

In [13]:
import numpy as np

In [9]:
#Dictionary of key pair values called data
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Age': [24, 23, 22, 19, 10],
 'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh']}

another way to create a dataframe is through a CSV file. Make sure to right click on the file in the "files" menu, and copy/paste "file path" when reading in the CSV into your dataframe

In [ ]:
#cars = pd.read_csv('cars.csv')

In [10]:
# Calling the pandas data frame method by passing the dictionary (data) as a parameter
df = pd.DataFrame(data)
df

      Name  Age
0   Ashika   24
1     Tanu   23
2   Ashwin   22
3    Mohit   19
4  Sourabh   10

**Selecting columns in a dataframe**

you can use brackets to select a column in the DataFrame. Selecting the column gives you access to the whole column, but will only show a preview. Below the column, the column name and data type (dtype) are printed for easy reference.

You can either use a single bracket or a double bracket. The single bracket will output a Pandas Series, while a double bracket will output a Pandas DataFrame

In [11]:
df['Name']

0     Ashika
1       Tanu
2     Ashwin
3      Mohit
4    Sourabh
Name: Name, dtype: object

In [12]:
df[['Name']]

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

**Selecting rows in a dataframe**

In [ ]:
#data[4:7]
data[4997:]

**Selecting a specific row**

To select a specific row, you must use the .ix method, with the row's index in brackets:

In [2]:
#data.ix[1]

**Selecting rows and columns **

Just as you can select from rows or columns, you can also select from both rows and columns at the same time. For example, you can select the first three rows of the title column by naming both the column and rows in square brackets:

In [4]:
#data['title'][:3]

**Working with missing data**

In [14]:
data ={'Name':['Tanu', np.nan],
       'Age': [23, np.nan]}
data

{'Age': [23, nan], 'Name': ['Tanu', nan]}

In [15]:
df = pd.DataFrame(data)
df

   Name   Age
0  Tanu  23.0
1   NaN   NaN

In [20]:
# using the isnull() function
df.isnull()

    Name    Age
0  False  False
1   True   True

Now we have found the missing values, next task is to fill those values with 0 this can be done as shown below:

In [18]:
df.fillna(0)

   Name   Age
0  Tanu  23.0
1     0   0.0

**Other helpful resources**



*   [Pandas basics - learn pandas
](https://www.learnpython.org/en/Pandas_Basics#:~:text=Indexing%20DataFrames&text=You%20can%20either%20use%20a,will%20output%20a%20Pandas%20DataFrame.&text=Square%20brackets%20can%20also%20be,(rows)%20from%20a%20DataFrame.)
*   [Dataframe basics](https://github.com/Tanu-N-Prabhu/Python/blob/master/Pandas/Pandas_DataFrame.ipynb)
*   List item